---
kind: property
id: P:Autodesk.Revit.UI.TaskDialog.TitleAutoPrefix
zh: 提示、弹窗、消息框
source: html/109dc817-315c-924d-09d9-07dd1451df96.htm
---
# Autodesk.Revit.UI.TaskDialog.TitleAutoPrefix Property

**中文**: 提示、弹窗、消息框

Whether the TaskDialog's title will automatically have the add-in name added as a prefix.

## Syntax (C#)
```csharp
public bool TitleAutoPrefix { get; set; }
```

## Remarks
The default value is true.